{"class_name": "Sequential", "keras_version": "2.1.6-tf", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"filters": 32, "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "dtype": "float32", "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "batch_input_shape": [null, 256, 256, 3], "kernel_size": [3, 3], "name": "conv2d", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d"}}, {"class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "rate": 0.2, "noise_shape": null, "name": "dropout", "seed": null}}, {"class_name": "Conv2D", "config": {"filters": 64, "strides": [1, 1], "dilation_rate": [1, 1], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "padding": "valid", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_1", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "rate": 0.2, "noise_shape": null, "name": "dropout_1", "seed": null}}, {"class_name": "Conv2D", "config": {"filters": 128, "strides": [1, 1], "dilation_rate": [1, 1], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "padding": "valid", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_2", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "rate": 0.2, "noise_shape": null, "name": "dropout_2", "seed": null}}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "flatten", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "trainable": true, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "bias_regularizer": null, "name": "dense", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "name": "activation", "activation": "relu"}}, {"class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "rate": 0.5, "noise_shape": null, "name": "dropout_3", "seed": null}}, {"class_name": "Dense", "config": {"dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "trainable": true, "units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "name": "activation_1", "activation": "softmax"}}], "name": "sequential"}}